app/controllers/api/appointments_controller.rb

INSERT INTO "appointments" ("title", "start_date", "end_date", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @appointment = Appointment.new(appointment_params)
    if @appointment.save