app/views/api/appointments/show.json.jbuilder

  json.appointments do
    @appointment.creator.appointments.each do |appointment|
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."creator_id" = $1  [["creator_id", 1]]